INSERT INTO suppliers (name, address, phone)
VALUES
  ('Поставщик 1', 'Адрес 1', 'Телефон 1'),
  ('Поставщик 2', 'Адрес 2', 'Телефон 2');

INSERT INTO parts (part_name, part_number, current_price)
VALUES
  ('Деталь 1', 'Артикул 1', 100.00),
  ('Деталь 2', 'Артикул 2', 150.00),
  ('Деталь 3', 'Артикул 3', 200.00),
  ('Деталь 4', 'Артикул 4', 350.00),
  ('Деталь 5', 'Артикул 5', 500.00);


INSERT INTO price_history (part_id, effective_date, price)
VALUES
  (1,'2023-01-01', 100.00 ),
  (1,'2023-02-01', 110.00 ),
  (2, '2023-01-01', 150.00 ),
  (1, '2022-01-01', 100.00),
  (2, '2022-01-01', 150.00),
  (3, '2022-01-01', 200.00),
  (1, '2023-01-01', 110.00),
  (2, '2023-01-01', 160.00),
  (3, '2023-01-01', 220.00),
  (1, '2023-05-01', 120.00),
  (2, '2023-05-01', 170.00),
  (3, '2023-05-01', 230.00);

INSERT INTO purchases (purchase_date, quantity, supplier_id, part_id)
VALUES
  ('2023-10-27', 10, 1, 1),
  ('2023-10-27', 5, 2, 1),
  ('2023-10-27', 5, 2, 2),
  ('2023-10-28', 8, 2, 3),
  ('2023-01-27', 10, 2, 4),
  ('2023-11-27', 5, 2, 5),
  ('2023-12-28', 8, 1, 2);

